"Markdown" = "\
*italic* or _italic_\
**bold** or __bold__\
\
# Header 1\
## Header 2\
### Header 3\
#### Header 4\
##### Header 5\
###### Header 6\
\
> Quote\
\
* List\
- List\
+ List\
\
`code`\
\
```syntax```\
\
[Link](url)\
![Image](url)\
";

"Markdown2" = "\
\
# h1 Heading 8-)\
## h2 Heading\
### h3 Heading\
#### h4 Heading\
##### h5 Heading\
###### h6 Heading\
\
\
## Horizontal Rules\
\
___\
\
---\
\
***\
\
\
## Typographic replacements\
\
Enable typographer option to see result.\
\
(c) (C) (r) (R) (tm) (TM) (p) (P) +-\
\
test.. test... test..... test?..... test!....\
\
!!!!!! ???? ,,  -- ---\
\
\"Smartypants, double quotes\" and \'single quotes\'\
\
\
## Emphasis\
\
**This is bold text**\
\
__This is bold text__\
\
*This is italic text*\
\
_This is italic text_\
\
~~Strikethrough~~\
\
\
## Blockquotes\
\
\
> Blockquotes can also be nested...\
>> ...by using additional greater-than signs right next to each other...\
> > > ...or with spaces between arrows.\
\
\
## Lists\
\
Unordered\
\
+ Create a list by starting a line with `+`, `-`, or `*`\
+ Sub-lists are made by indenting 2 spaces:\
- Marker character change forces new list start:\
* Ac tristique libero volutpat at\
+ Facilisis in pretium nisl aliquet\
- Nulla volutpat aliquam velit\
+ Very easy!\
\
Ordered\
\
1. Lorem ipsum dolor sit amet\
2. Consectetur adipiscing elit\
3. Integer molestie lorem at massa\
\
\
1. You can use sequential numbers...\
1. ...or keep all the numbers as `1.`\
\
Start numbering with offset:\
\
57. foo\
1. bar\
\
\
## Code\
\
Inline `code`\
\
Indented code\
\
// Some comments\
line 1 of code\
line 2 of code\
line 3 of code\
\
\
Block code \"fences\"\
\
```\
Sample text here...\
```\
\
Syntax highlighting\
\
``` js\
var foo = function (bar) {\
    return bar++;\
};\
\
console.log(foo(5));\
```\
\
## Tables\
\
| Option | Description |\
| ------ | ----------- |\
| data   | path to data files to supply the data that will be passed into templates. |\
| engine | engine to be used for processing templates. Handlebars is the default. |\
| ext    | extension to be used for dest files. |\
\
Right aligned columns\
\
| Option | Description |\
| ------:| -----------:|\
| data   | path to data files to supply the data that will be passed into templates. |\
| engine | engine to be used for processing templates. Handlebars is the default. |\
| ext    | extension to be used for dest files. |\
\
\
## Links\
\
[link text](http://dev.nodeca.com)\
\
[link with title](http://nodeca.github.io/pica/demo/ \"title text!\")\
\
Autoconverted link https://github.com/nodeca/pica (enable linkify to see)\
\
\
## Images\
\
![Minion](https://octodex.github.com/images/minion.png)\
![Stormtroopocat](https://octodex.github.com/images/stormtroopocat.jpg \"The Stormtroopocat\")\
\
Like links, Images also have a footnote style syntax\
\
![Alt text][id]\
\
With a reference later in the document defining the URL location:\
\
[id]: https://octodex.github.com/images/dojocat.jpg  \"The Dojocat\"\
\
\
## Plugins\
\
The killer feature of `markdown-it` is very effective support of\
[syntax plugins](https://www.npmjs.org/browse/keyword/markdown-it-plugin).\
\
\
### [Emojies](https://github.com/markdown-it/markdown-it-emoji)\
\
> Classic markup: :wink: :crush: :cry: :tear: :laughing: :yum:\
>\
> Shortcuts (emoticons): :-) :-( 8-) ;)\
\
see [how to change output](https://github.com/markdown-it/markdown-it-emoji#change-output) with twemoji.\
\
\
### [Subscript](https://github.com/markdown-it/markdown-it-sub) / [Superscript](https://github.com/markdown-it/markdown-it-sup)\
\
- 19^th^\
- H~2~O\
\
\
### [\<ins>](https://github.com/markdown-it/markdown-it-ins)\
\
++Inserted text++\
\
\
### [\<mark>](https://github.com/markdown-it/markdown-it-mark)\
\
==Marked text==\
\
\
### [Footnotes](https://github.com/markdown-it/markdown-it-footnote)\
\
Footnote 1 link[^first].\
\
Footnote 2 link[^second].\
\
Inline footnote^[Text of inline footnote] definition.\
\
Duplicated footnote reference[^second].\
\
[^first]: Footnote **can have markup**\
\
and multiple paragraphs.\
\
[^second]: Footnote text.\
\
\
### [Definition lists](https://github.com/markdown-it/markdown-it-deflist)\
\
Term 1\
\
:   Definition 1\
with lazy continuation.\
\
Term 2 with *inline markup*\
\
:   Definition 2\
\
{ some code, part of Definition 2 }\
\
Third paragraph of definition 2.\
\
_Compact style:_\
\
Term 1\
~ Definition 1\
\
Term 2\
~ Definition 2a\
~ Definition 2b\
\
\
### [Abbreviations](https://github.com/markdown-it/markdown-it-abbr)\
\
This is HTML abbreviation example.\
\
It converts \"HTML\", but keep intact partial entries like \"xxxHTMLyyy\" and so on.\
\
*[HTML]: Hyper Text Markup Language\
\
### [Custom containers](https://github.com/markdown-it/markdown-it-container)\
\
::: warning\
*here be dragons*\
:::\
\
";

"Markdown3" = "\
### Evidence of an N+1 query performance antipattern detected\
For each recorded `ApplicationSettingService/update` [transaction](https://docs.newrelic.com/docs/apm/transactions) in [Mobile Connect Endpoint](https://staging.newrelic.com/accounts/1/applications/434371/transactions), `MySQL application_licenses select` was called an average of **2,396 times**.\
The highest number of calls for a single transaction was **7,487**.\
\
&nbsp;\
\
These potentially unnecessary calls take up about **25%** of the entire transaction duration.\
\
* Last longer bullet that is a detailed solution for quadratic equatitions Last longer bullet that is a detailed solution for quadratic equatitions Last longer bullet that is a detailed solution for quadratic equatitions Last longer bullet that is a detailed solution for quadratic equatitions\
* Bullet 1\
** Test indent one that is longer and might do some fun stuff\
*** Test indent one that is longer and might do some fun stuff\
**** Test indent one that is longer and might do some fun stuff\
***** Test indent one that is longer and might do some fun stuff\
** Not as long\
* Bullet that is longer and it should be a oggaoeu oansteuh aoe ht ueath eu etahou eh \
\
* Another bullet thit is after a line\
* Last longer bullet that is a detailed solution for quadratic equatitions Last longer bullet that is a detailed solution for quadratic equatitions Last longer bullet that is a detailed solution for quadratic equatitions Last longer bullet that is a detailed solution for quadratic equatitions\
\
#### What is an N+1 query anti-pattern?\
\
It provides a standard format for distributing Ruby libraries (`gem ( code statment ) with stuff ! &'s`). See the [RubyGems guide](http://guides.rubypackages.org/rubygems-basics/) for more information.\
This [anti-pattern](https://en.wikibooks.org/wiki/Introduction_to_Software_Engineering/Architecture/Anti-Patterns) will cause a separate database query for each record, rather than fetching data for all records in batched requests.\
\
We have text [Links with Parenthesis (this one is good)](https://www.example.com) and more text\
For example, assume an application has two tables, `posts` and `likes`. A `post` has many `likes`. Fetching all `posts` and `likes` using the anti-pattern might look like this:\
\
```\
// Returns 1000 posts\
var posts = database.query(\"SELECT * FROM Posts ORDER BY id DESC LIMIT 1000\")\
\
// Lookup Likes for each Post record\nfor (var i = 0; i < posts.length; i++) {\
var likes = database.query(\"SELECT * FROM Likes WHERE postId={post.id}\")\
}\
```\
\
This method will make `N+1` queries, where `N` is the number of posts. In this case, 1001 separate queries would be made. Ideally, this would only take 2 queries:\
\
```\
var posts = database.query(\"SELECT * FROM Posts ORDER BY id DESC LIMIT 1000\")\
var likes = database.query(\"SELECT * FROM Likes WHERE postId IN ({posts.map(id)})\")\
```\
\
In some cases, this anti-pattern can arise when [lazily fetching](https://en.wikipedia.org/wiki/Lazy_loading) results. Try [eagerly loading](http://stackoverflow.com/a/1299381) results to [minimize database time](https://docs.newrelic.com/docs/apm/applications-menu/monitoring/databases-slow-queries-page).\
\
";
